#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.api.data.local_file.mock_response_get_files["about_page_content"]: Reading...
module.api.data.local_file.mock_response_get_files["featured_projects"]: Reading...
module.api.data.local_file.mock_response_get_files["about_page_content"]: Read complete after 0s [id=d3b845625b1da606b2782181d2fa37859285d76c]
module.api.data.local_file.mock_response_get_files["featured_projects"]: Read complete after 0s [id=e32261d3c5c27bd4e8a1dd61ec4b12c695eae63f]
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.storage.aws_s3_bucket.thomaskimble_storage: Refreshing state... [id=thomaskimble-storage]
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.domain_management.aws_route53_record.thomaskimble_storage_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_storage_CNAME]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.api.aws_api_gateway_resource.mock_get_resources["about_page_content"]: Refreshing state... [id=8em389]
module.api.aws_api_gateway_resource.mock_get_resources["featured_projects"]: Refreshing state... [id=kn1j9q]
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_method.mock_get_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-GET]
module.api.aws_api_gateway_method.mock_get_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-GET]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.domain_management.aws_route53_record.thomaskimble_api_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.api.aws_api_gateway_method_response.mock_get_method_responses["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_method_response.mock_get_method_responses["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["featured_projects"]: Refreshing state... [id=agir-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_integration.mock_get_integrations["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["about_page_content"]: Refreshing state... [id=agir-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration.mock_get_integrations["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-GET]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=zzvq0i]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.domain_management.aws_route53_record.thomaskimble_storage_record will be updated in-place
  ~ resource "aws_route53_record" "thomaskimble_storage_record" {
        id                               = "Z09261682MMR79C15BLZ9_storage_CNAME"
        name                             = "storage"
      ~ records                          = [
          - "thomaskimble-storage.s3.eu-west-1.amazonaws.com",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.storage.aws_s3_bucket.thomaskimble_bucket will be created
  + resource "aws_s3_bucket" "thomaskimble_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "thomaskimble-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.storage.aws_s3_bucket.thomaskimble_storage will be destroyed
  # (because aws_s3_bucket.thomaskimble_storage is not in configuration)
  - resource "aws_s3_bucket" "thomaskimble_storage" {
      - arn                         = "arn:aws:s3:::thomaskimble-storage" -> null
      - bucket                      = "thomaskimble-storage" -> null
      - bucket_domain_name          = "thomaskimble-storage.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "thomaskimble-storage.s3.eu-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
      - id                          = "thomaskimble-storage" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "94f1086d92abc1d97dc7b580b6aa135dfe0efe7b29790c3020f0c7a6e197f400" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.storage.aws_s3_bucket_cors_configuration.thomaskimble_bucket_cors_configuration will be created
  + resource "aws_s3_bucket_cors_configuration" "thomaskimble_bucket_cors_configuration" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*